{"variant":"0","technical":"33","instructions":[{"title":"SURFACE PREPARATION","data":"Allow new concrete to dry for 14-28 days under normal weather conditions before painting.\nSurface to be painted should be clean and dry, free from oil, grease, dust, dirt, contaminants, and all loose grit and mortar.\nIf neutralizing, treat surface with a solution of 1 part <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Masonry Neutralizer B&#8209;44 diluted in 16 parts water, applying liberally by brush or roller. Let dry overnight before rinsing with water to remove white crystals that form on the surface. Let dry before painting.\nNote: If the concrete has been cured for more than 28 days, there is no need for neutralizer.\n"},{"title":"APPLICATION SCHEDULE","data":"Prime the entire concrete surface, whether previously painted or bare, with Marmorino Primer B&#8209;5005.\nUsing the provided Marmorino Trowel, liberally apply a coat of prepared colored Marmorino Classico (Marmorino Classico mixed with the desired Marmorino Toner) onto the properly prepared surface.\nApply a second coat of the colored Marmorino Classico and keep ridges and trowel imperfections to a minimum. Allow this to dry overnight until wet spots are no longer visible.\nSpot apply a third coat of colored Marmorino Classico to achieve the desired marble pattern. Allow setting for a few minutes only.\nFor polishing, press in some more Marmorino Classico using the trowel for surface leveling. This is to achieve a more uniform and smoother finish. Let dry for another 48 hours.\nOnce Marmorino has dried, use a soft sponge to apply the provided Natural Wax Protection, B&#8209;5000. Work the wax into the surface and wipe any excess fluid off. Cover about 1 square meter at a time for better control over the design.\nFinally, smooth over the surface using a soft, lint-free cloth.\n"},{"title":"NOTES","data":"To create a variety of shades, add a minimum of one to a maximum of seven 240-gram Marmorino toner for every 24-kg pail of Marmorino Classico.\nUse only Marmorino Toners for Marmorino Classico.\n"}],"calculator":[{"title":"Primer","header":"0","factor":"0.13333333333333","item":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Marmorino&trade; Primer B&#8209;5005","unit":"L","note":""},{"title":"Italian Marble Finish","header":"0","factor":"1","item":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Marmorino&trade; Classico B&#8209;5010","unit":"kg","note":""},{"title":"Toner (Full-tone)","header":"0","factor":"70","item":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Marmorino&trade; Toner","unit":"g","note":""}]}