{"variant":"0","technical":"33","instructions":[{"title":"SURFACE PREPARATION","data":"Install and secure joints as per manufacturer's recommendations.\nCheck paint compatibility and recommended drying time of the applied joint compound.\nSurface to be painted should be clean and dry, free from dust and dirt and all possible contaminants."},{"title":"APPLICATION SCHEDULE","data":"Prime the entire surface, whether previously painted or bare, with Marmorino&trade; Primer B&#8209;5005.\nUsing the provided Marmorino&trade; Trowel, liberally apply a coat of prepared colored Marmorino&trade; Classico (Marmorino&trade; Classico mixed with the desired Marmorino&trade; Toner) onto the properly prepared surface.\nApply a second coat of the colored Marmorino&trade; Classico and keep ridges and trowel imperfections to a minimum. Allow this to dry overnight until wet spots are no longer visible.\nSpot apply a third coat of colored Marmorino&trade; Classico to achieve the desired marble pattern. Allow setting for a few minutes only.\nFor polishing, press in some more Marmorino&trade; Classico using the trowel for surface leveling. This is to achieve a more uniform and smoother finish. Let dry for another 48 hours.\nOnce Marmorino&trade; has dried, use a soft sponge to apply the provided Natural Wax Protection, B&#8209;5000. Work the wax into the surface and wipe any excess fluid off. Cover about 1 square meter at a time for better control over the design.\nFinally, smooth over the surface using a soft, lint-free cloth."},{"title":"NOTES","data":"To create a variety of shades, add a minimum of one to a maximum of seven 240-gram Marmorino&trade; toner for every 24-kg pail of Marmorino&trade; Classico.\nUse only Marmorino&trade; Toners for Marmorino&trade; Classico."}],"calculator":[{"title":"Primer","header":"0","factor":"0.13333333333333","item":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Marmorino&trade; Primer","unit":"L","note":"","decimal":"0","mathfloorfactor":"0.5"},{"title":"Italian Marble Finish","header":"0","factor":"1","item":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Marmorino&trade; Classico","unit":"kg","note":"","decimal":"0","mathfloorfactor":"0.5"},{"title":"Toner (Full-tone)","header":"0","factor":"70","item":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Marmorino&trade; Toner","unit":"g","note":"","decimal":"0","mathfloorfactor":"0.5"},{"title":"Note: Install and secure joints as per manufacturer's recommendation","header":"0","factor":"0","item":"","unit":"","note":"","decimal":"0","mathfloorfactor":"0.5"}]}