{"variant":"0","technical":"10","instructions":[{"title":"SURFACE PREPARATION","data":"Remove all existing paint or coating by manual or mechanical methods.\nHammer all nails deep enough to apply putty.\nSand surface until wood is smooth to the touch.\nDust off surfaces completely then wipe with a clean rag.\n"},{"title":"PAINTING SCHEDULE","data":"Apply <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade; to bare wood without primers or undercoats either by brush, spray or by dipping in an open trough or tank to achieve total covering rate.\r\nShake and stir Xyladecor often during use.\r\nBy Brush:\r\nLightly brush or wipe over once along the grain to remove excess material and to smooth out any runs. Leave each coat for about 4-8 hours or until totally dry. Recoat for a darker shade.\r\nBy Spray:\r\nUse a nozzle (about 1.5 mm) giving a stream of material. Working pressure should be approximately 40 psi.\r\nBy Dipping:\r\nDip the timber in <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade; for 2 minutes, varying the time required according to the absorbency of the wood. Stand the timber on end and allow to drain.\r\nIf necessary, lightly brush the surface once in the direction of the grain before it dries.\r\n"},{"title":"NOTES","data":"If a very even colored finish is desired on the wooden substrate with varying degrees of absorbency, apply <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade; Colorless first before applying the colored varieties of Xyladecor.\n<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade; Colorless is not recommended for exterior use on its own.\n"}],"calculator":[{"title":"Stain","header":"0","factor":"0.32","item":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade;","unit":"L","note":"Apply to bare wood without primers or undercoats."}]}