{"id":"74","name":"Konstrukt&trade; Permaplast&trade;","subtitle":"K-201 High-Performance Acrylic Skimcoat","image":"data\/1074.jpg","url":"konstrukt-permaplast-k-201-high-performance-acrylic-skimcoat","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/web\/full\/1074.jpg","canimageurl":"","rgbhexcolor":"","imagelogourl":"","imageweburl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/page\/full\/1074.jpg","imagewebmobileurl":"","bannerurl":"","colors":"0","techdata":"9","linkdata":[{"title":"Download Brochure","url":"https:\/\/files.boysencdn.com\/boysen\/brochures\/Konstrukt Construction Chemicals eBrochure.pdf"}],"info":[{"title":"DESCRIPTION","subtitle":"","body":"Konstrukt&trade; Permaplast&trade; K-201 High-Performance Acrylic Skimcoat is a specially formulated bonding paste that is mixed with cement and applied on interior and exterior concrete substrates to correct surface imperfections prior to painting. It dries to a smooth cement finish and it repairs bubbles, honeycomb, and concrete defects such as waviness and plumbness from 2mm to 3mm thick."},{"title":"PRINCIPAL USES","variant":"0","subtitle":"","body":"It is ideal for interior and exterior concrete surfaces."},{"title":"FEATURES","variant":"0","subtitle":"","body":"Fixes wall imperfections from 2mm to 3mm thick\nMinimizes the use of putty\nMinimizes cracking and improves water resistance\nImproves alkali resistance\nImparts a smooth, luxurious look"},{"title":"SERVICE CONDITIONS","variant":"0","subtitle":"","body":"Do not apply product on painted surface."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"Surface should be clean and dry, free from oil, grease, dirt, contaminants, and all loose grit and mortar. Defects on concrete like plumbness that are more than 3mm thick should be addressed by using exterior renders. Always dampen the concrete before application. Plastered walls should already be cured for at least 14-28 days prior to the application of a skimcoat."},{"title":"MATERIAL PREPARATION","variant":"0","subtitle":"","body":"Put K-201 High-Performance Acrylic Skimcoat in a suitable container and mix it with sifted cement at a 1:1 ratio by weight until a lump-free, homogenous paste is achieved. Do not add water. Use Portland cement (for ordinary cement color) or white cement (to produce a white finish)."},{"title":"APPLICATION SCHEDULE","variant":"0","subtitle":"","body":"Using a steel trowel, apply a thin layer of mixture on the surface by firmly pressing the edge of the trowel on the concrete until all areas are covered. Let it dry for at least 1 hour before applying the second coat. If trowel marks are visible, let surface dry for at least another hour before sanding to further smoothen surfaces. Allow at least 7 days before painting. No need to neutralize."}]}