{"id":"116","name":"Konstrukt&trade; Lunar Series: Kashmir","subtitle":"","image":"data\/1116.jpg","url":"konstrukt-lunar-series-kashmir","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/web\/full\/1116.jpg","imageweburl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/page\/full\/1116.jpg","imagewebmobileurl":"","bannerurl":"","colors":1,"techdata":0,"info":[{"title":"DESCRIPTION","subtitle":"","body":"From afar, the moon gleams exquisitely at sundown. It envelopes the night with mysterious aura, silently luring a curious spectator in. Its lulling presence pacifies the hardness of the day. Utterly hypnotizing, one experiences a sense of calm and completeness. Dazed eyes can't simply look away from it. Further zoom into its surface, it boasts varying textures - tiny and large craters, dark stretches, and rough impacts. Bombarded with asteroids and meteorites colliding with the lunar surface, it comes out beautifully undone. The moon is perfectly imperfect. \n\nThe Konstrukt&trade; Lunar Series is inspired by the aesthetically fascinating features of the moon. Each faux finish is striking but not overwhelming to the eye. The minimalist appeal and sleek ambiance add a flair of sophistication to any living space. Its simplicity and versatility render it as a perfect backdrop to highlight centerpieces. It is subtle but impactful - luxurious without being indulgent."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"Remove honeycomb and loose concrete.\nCheck and repair all relevant surface defects (i.e., cracks, gaps) by corrective civil works, water proof as necessary.\nMake sure that the surface to be coated is clean, dry and that good weather persists prior to application."},{"title":"MIXING AND APPLICATION PROCEDURE","variant":"0","subtitle":"","body":"1. Please follow mixing procedures of Konstrukt&trade; Permaplast&trade; K-201 High Performance Acrylic Skimcoat below:\n Stir Konstrukt&trade; Permaplast&trade; K-201 High Performance Acrylic Skimcoat using mixing device to attain consistency.\n Transfer mixture to another clean bucket, mix it with Portland cement (1:1 ratio) using a mixing device until desirable consistency is attained.\n Please note that color of the mixture may vary depending on brand of cement.\n\n2. Please follow application procedures of Konstrukt&trade; Permaplast&trade; K-201 High Performance Acrylic Skimcoat below:\n Using a steel trowel, apply the mixture thinly on the surface by pressing the edge of the trowel firmly on the concrete until all areas are covered. \n Let it dry for at least sixty (60) minutes before applying the second coat. Apply on random strokes to achieve the cement look. (do the same process for the third coat if necessary). \n Let it dry for at least sixty (60) minutes before polishing. Using the steel trowel, angle to 45 degrees and press firmly on all areas covered to smoothen.\n No need to neutralize the surface. \n Allow at least seven (7) days curing time before application of clear coat."},{"title":"PAINTING SYSTEM PROCEDURE","variant":"0","subtitle":"","body":"Apply a single coat of <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Acrytex&trade; Sealer B&#8209;1708\nLet it dry for at least two (2) hours before application of <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Matte Shield&trade; B&#8209;4600\nApply two (2) coats of <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Matte Shield&trade; B&#8209;4600 with two (2) hours coat interval\nWhen using roller, make sure to use paint tray to remove excess paint and apply thinly to prevent roller marks.\nApplication by spray is advised to prevent lap marks."}]}