{"id":"86","name":"Nation&trade; Flatwall Enamel NS-800","subtitle":"","image":"data\/1086.jpg","colors":0,"techdata":"10","info":[{"title":"DESCRIPTION","subtitle":"","body":"Nation&trade; Flatwall Enamel is a fast-drying, economy-line, alkyd-based paint that cures to a beautiful flat finish. It is formulated to give a tough and beautiful finish on both wood and metal substrates. Due to its good opacity, it can be used as a primer for enamel-based coatings."},{"title":"PRINCIPAL USES","variant":"0","subtitle":"","body":"For interior and exterior wood and metal surfaces"},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"Wooden Surfaces","body":"Surface to be painted should be clean and dry, free from dust, dirt, and other foreign matter. Hammer all nails deep enough to apply putty. Sand rough wood until smooth and then dust off before painting.\nFor repainting, scrape off all loose, scaling, flaking, and peeling paint manually or by using <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Paint and Varnish Remover B&#8209;141, as necessary. Wash surfaces clean and completely remove chemical residue. Let it dry. Prime with NATION Flatwall Enamel White NS-800 before recoating."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"Metal Surfaces","body":"Wipe the surface with a rag soaked in paint thinner to remove grease, oil, wax and other foreign matter. For new galvanized surfaces, etch the surface by applying 10% <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Metal Etching Solution B&#8209;71 (Dilute 1 part of B&#8209;71 to 9 parts water). Rinse with water and dry immediately. \nUnpainted galvanized surfaces that have been exposed for 6 months or more need not be etched. \nFor recoating pre-painted galvanized surfaces in good condition, sand lightly then wipe the surface with a clean rag before applying paint. Remove all loose paint film to sound surface. Spot prime bare substrate.\nFor corroded galvanized surfaces, remove rust by wire brushing and use <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Metal Etching Solution B&#8209;71. Let it stay for 10-15 minutes. Be sure to remove all remaining residue. Immediately prime after drying."},{"title":"PAINTING SCHEDULE","variant":"0","subtitle":"Wood","body":"1st coat: Nation&trade; Flatwall Enamel NS-800\nPutty: <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Plasolux Glaxing Putty B&#8209;311\n2nd & 3rd coat: Nation&trade; Fast Dry Enamel (any desired color)"},{"title":"PAINTING SCHEDULE","variant":"0","subtitle":"Metal","body":"1st coat: Nation&trade; Red Oxide Metal Primer NS-610\n2nd & 3rd coat: Nation&trade; Fast Dry Enamel (any desired color)"}]}