{"id":"23","name":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade; Classic","subtitle":"","image":"data\/1023.jpg","colors":30,"techdata":"24","info":[{"title":"DESCRIPTION","subtitle":"","body":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade;  Classic is a unique, water-based decorative paint system that can simulate the complex texture and distinctive finish of the European masters right in your home. Unlike traditional faux finishes, <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade; Classic does not need elaborate intermixing of colors, layering techniques or sophisticated equipment. Simple and effortless brushing is all that's required to achieve this very exquisite finish."},{"title":"PRINCIPAL USES","variant":"0","subtitle":"","body":"It is ideal for interior concrete walls, properly primed wood, and drywalls. Avoid using product on high friction areas like fixtures and furniture."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"New Concrete","body":"Allow new concrete to dry for 14-28 days under normal weather conditions before painting. Surface to be painted should be clean and dry, free from oil, grease, dust, dirt, contaminants, and all loose grit and mortar. If neutralizing, treat surface with a solution of 1 part <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Masonry Neutralizer B&#8209;44 diluted in 16 parts water, applying liberally by brush or roller. Let dry overnight before rinsing with water to remove white crystals that form on the surface. Let dry before painting. However, if the concrete has been cured for more than 28 days, there is no need for neutralizer."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"Wooden Surfaces","body":"Surface to be painted should be clean and dry, free from dust, dirt, and other foreign matter. Hammer all nails deep enough to apply putty. Sand rough wood until smooth and then dust off before painting."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"Drywall Substrates","body":"Install and secure joints as per manufacturer’s recommendations."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"Repainting","body":"Scrape off all loose, scaling, flaking, and peeling paint as necessary. Make sure the surface is clean, dry, and good weather persists prior to painting.\nFor repainting concrete with chalky old paint, use <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Chalk Blocker&trade; B&#8209;7304 as surface conditioner. In case of mildew infestation, treat with a bleach solution (1:3, laundry bleach to water, respectively) by swabbing or brushing. To ensure proper treatment, let stand for 24 hours before cleaning off residue. Let dry.\nFor repainting other surfaces such as wood, apply the appropriate primer before recoating."},{"title":"PAINTING SCHEDULE","variant":"0","subtitle":"","body":"Apply <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Permacoat&trade; Flat Latex B&#8209;701 as primer for concrete. For wood, use <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Flatwall Enamel B&#8209;800.\nAfter primer application, apply <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade; Undercoat B&#8209;4605 by brush or roller and fully cover the surface. Dry for 1 hour before applying the finishing layer.\nNote: The design can only be achieved using <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade; Undercoat. \nAfter choosing the desired color, mix <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade; Toner into <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade; Base B&#8209;4610. A color can be applied in different tones by varying amount of toner used, either Full, One-half, One-Fourth, or any other proportion depending on desired shade. Stir until uniform consistency is achieved. DO NOT THIN MIXTURE WITH WATER OR ANY SOLVENT.\nUsing a <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade; brush, apply from top corner, working with short crisscrossing strokes. If a more uniform pattern is desired, brush through surface while the paint is still wet.\nNote: The design may not be achieved if a different paintbrush is used.\nWait for 8-10 minutes after applying <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> DECORe&trade;. Then, lightly comb the surface using the plastic scraper with long crisscrossing strokes, the scraper inclined and close to the surface."}]}