{"id":"77","name":"Konstrukt&trade; Permaplast&trade;","subtitle":"K-220 Interior Superfine White Skimcoat & K-252 Interior Skimcoat Sealer","image":"data\/1077.jpg","url":"konstrukt-permaplast-k-220-interior-superfine-white-skimcoat-k-221-interior-superfine-skimcoat-k-252-interior-skimcoat-sealer","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/web\/full\/77\/09bf2f4d-4d8d-4e54-9812-f888280fc85e\/konstrukt permaplast k-220  k-252.jpg","canimageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/can\/77\/1ed28619-f173-49ba-9602-76b563769946\/konstrukt permaplast k-220  k-252.png","rgbhexcolor":"","imagelogourl":"","imageweburl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/page\/full\/77\/48202097-238a-4b6c-83c2-719a29c0cb93\/1088.jpg","imagewebmobileurl":"","bannerurl":"","colors":"0","techdata":"20","linkdata":[],"info":[{"title":"DESCRIPTION","subtitle":"","body":"Konstrukt&trade; Permaplast&trade; K-220 Interior Superfine White Skimcoat is a powder-type skimcoat for correcting surface imperfections on interior concrete surfaces. It repairs bubbles, honeycomb, and other concrete defects such as waviness and plumbness from 1mm to 3mm thick.\n\nThis product is applied prior to the application of Konstrukt&trade; Permaplast&trade; K-252 Interior Skimcoat Sealer, an acrylic-based primer.\n\nThe application of Konstrukt&trade; Permaplast&trade; provides a sound and even surface on walls and ceilings for the succeeding coats of paint."},{"title":"SERVICE CONDITIONS","variant":"1","subtitle":"","body":"The use of K-252 Interior Skimcoat Sealer is required after the application of K-220."},{"title":"SURFACE PREPARATION","variant":"1","subtitle":"","body":"Check and repair all relevant defects by consulting necessary civil works. Make sure that the surface is clean and dry and is free from dirt and oil prior to application. Always dampen the concrete substrate before application. Plastered walls should already be cured for at least 14-28 days prior to the application of the skimcoat."},{"title":"MATERIAL PREPARATION","variant":"1","subtitle":"","body":"Mix 20-kgs of K-220 Interior Superfine White Skimcoat with 7- Liters of waters in a suitable container until a lump-free homogenous paste is reached. Only mix enough product that can be used within 30 minutes working time. Avoid adding water to the mixture that has begun to set."},{"title":"APPLICATION SCHEDULE","variant":"1","subtitle":"","body":"Using a steel trowel, apply the mixture thinly on the surface by pressing the edge of the trowel firmly on the concrete substrate until all areas are covered. Let it dry for at least 1 hour before applying the second coat, if necessary. If trowel marks are visible, let surface dry for at least 1 hour before sanding to further smooth surfaces."}]}