{"id":"78","name":"Konstrukt&trade; Permaplast&trade;","subtitle":"K-222 Interior Render","image":"data\/1078.jpg","url":"konstrukt-permaplast-k-222-interior-render","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/web\/full\/1078.jpg","canimageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/can\/78\/70a28766-5266-430c-8cb2-28835846f9b5\/konstrukt permaplast k-222 interior render.png","rgbhexcolor":"","imagelogourl":"","imageweburl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/page\/full\/1078.jpg","imagewebmobileurl":"","bannerurl":"","colors":"0","techdata":"9","linkdata":[{"title":"Download Brochure","url":"https:\/\/files.boysencdn.com\/boysen\/brochures\/Konstrukt Construction Chemicals eBrochure.pdf"}],"info":[{"title":"DESCRIPTION","subtitle":"","body":"Konstrukt&trade; Permaplast&trade; K-222 Interior Render is a cement-based plaster used to level uneven concrete substrates. It dries to a fine sand finish and repairs bubbles, honeycomb, and concrete defects such as waviness, plumbness, large holes and cracks from 3mm to 8mm thick."},{"title":"FEATURES","variant":"0","subtitle":"","body":"Fills in deep cracks from 3mm to 8mm, resulting in quick repairs done in less time with better value-for-money\nProvides good crack resistance, excellent adhesion to old concrete, and makes it stronger than regular concrete plaster"},{"title":"SERVICE CONDITIONS","variant":"0","subtitle":"","body":"Defects on concrete plumbness that are 3-8mm thick can be addressed using K-222 Interior Render. If concrete defect is more than 8mm thick, conduct corrective civil works. Always dampen the concrete before application."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"Surface should be clean and dry, free from oil, grease, dirt, contaminants, and all loose grit and mortar. Always dampen the concrete before application. Plastered walls should already be cured for at least 14-28 days prior to the application of the interior render."},{"title":"MATERIAL PREPARATION","variant":"0","subtitle":"","body":"Mix Konstrukt&trade; Permaplast&trade; K-222 Interior Render (25-kg bag) with 5.5 Liters of water in a clean container. Using a mixing device, stir until trowelable consistency is attained.  Take note that once mixed, the product should be used within 1-2 hours. Avoid adding water into mixture that has begun to set as it will weaken product properties."},{"title":"APPLICATION SCHEDULE","variant":"0","subtitle":"","body":"Using a steel trowel, apply the mixture on uneven surfaces, initially on surfaces with deep openings not more than 8mm in depth. Let the product dry for an hour before applying the second coat, if necessary. For a smooth finish, apply Konstrukt&trade; Permaplast&trade; K-201 High-Performance Acrylic Skimcoat over K-222 Interior Render after K-222 has cured for 3 days."}]}