{"id":"80","name":"Konstrukt&trade; Tileworks&trade;","subtitle":"K-321 Tile Adhesion Promoter and K-302 All-Purpose Tile Adhesive","image":"data\/1080.jpg","url":"konstrukt-tileworks-k-321-tile-adhesion-promoter-and-k-302-all-purpose-tile-adhesive","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/full\/1080.jpg","bannerurl":"","colors":0,"techdata":"14","info":[{"title":"DESCRIPTION","subtitle":"","body":"Konstrukt&trade; Tileworks&trade; K-302 All-Purpose Tile Adhesive is a cement-based adhesive formulated for installing and fixing ceramic tiles on horizontal and vertical concrete surfaces for both thin-bed and thick-bed applications.\nKonstrukt&trade; Tileworks&trade; K-321 Tile Adhesion Promoter is an acrylic-based liquid emulsion that is mixed with Konstrukt&trade; Tileworks&trade; K-302 All-Purpose Tile Adhesive for tile-on-tile and heavy-duty applications."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"Surface should be clean and dry, free from dust, dirt, and other foreign matter.  It is important to dampen the substrate prior to the application of the tile adhesive."},{"title":"APPLICATION SCHEDULE","variant":"0","subtitle":"For Heavy-Duty Applications","body":"Mix a 25-kg bag of K-302 All-Purpose Tile Adhesive with 6-Liters of clean water in a clean container. Add at least ¼ Liters of K-321 Tile Adhesion Promoter and stir with a mixing device until desirable consistency is achieved. \nDampen the substrate prior to application of product. Using a notched trowel, spread the adhesive around a square meter at a time. Apply to desired level to smoothen any uneven surfaces. Place and align tiles. Adjust height accordingly by gently tapping the tiles using a rubber mallet. Fix tiles immediately within the 15-minute open time."},{"title":"APPLICATION SCHEDULE","variant":"0","subtitle":"For Tile-on-Tile Applications","body":"Mix 1-Liter of K-321 Tile Adhesion Promoter, 1-Liter of clean water, and 3-kg of K-302 All-Purpose Tile Adhesive in a clean container. After attaining the desired consistency, apply the mixture using a brush on the existing tiles. Let the mixture dry for 3 to 4 hours or overnight before tiling.\nFor horizontal application, add ¼ Liter of K-321 Tile Adhesion Promoter per 25-kg bag of K-302 All-Purpose Tile Adhesive\nFor vertical application, add ½ Liter of K-321 Tile Adhesion Promoter per 25-kg bag of K-302 All-Purpose Tile Adhesive.\nUsing a notched trowel, spread the adhesive a square meter at a time. Apply up to 3mm minimum thickness."}]}