{"id":"58","name":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Plexibond&trade; B&#8209;7760","subtitle":"Cementitious Waterproofing System","image":"data\/1058.jpg","colors":0,"techdata":"11","info":[{"title":"DESCRIPTION","subtitle":"","body":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Plexibond&trade;  is a specially formulated acrylic polymer designed for compounding with Portland cement. The resulting mixture possesses excellent adhesion, water resistance, and flexibility even on thin section applications. Its use eliminates water seepage. This makes it ideal for positive side waterproofing roof decks and firewalls."},{"title":"PRINCIPAL USES","variant":"0","subtitle":"","body":"Excellent adhesion on concrete substrates."},{"title":"FEATURES","variant":"0","subtitle":"Outstanding Flexibility","body":"Plexibond-modified cement possesses superior flexibility, eliminating cement-plastering defects. It maintains the integrity of the mortar with its excellent adhesive and tensile strength."},{"title":"FEATURES","variant":"0","subtitle":"Excellent Water Resistance","body":"It forms a seamless, non-porous, impenetrable layer that disperses any liquid upon contact, preventing any water seepage when applied on both vertical and horizontal surfaces."},{"title":"FEATURES","variant":"0","subtitle":"Resistant to Weathering","body":"It has excellent sunlight exposure resistance, prolonging the service life of light building materials such as marine plywood and fiber cement boards."},{"title":"FEATURES","variant":"0","subtitle":"Beautifies","body":"It can also be brushed on as a plaster finish or applied by using a textured roller or a mortar gun, resulting in an attractive \"orange peel\" texture cementitious coating."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Plexibond&trade; should be applied on bare concrete, wood, or metal that has not been previously painted. Existing paint should be totally scraped off. New masonry should be allowed to cure for at least 14-28 days. The surface should be clean, free from oil, grease, dust, dirt, and any loose grit or mortar. Dampen concrete surfaces first with water before applying Plexibond mix to avoid abrupt drying and cracking of the applied modified cement, especially under hot and sunny conditions."},{"title":"MATERIAL PREPARATION","variant":"0","subtitle":"","body":"Slowly mix 6.5-7.5 kilograms of cement to 4-Liters of <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Plexibond&trade; while constantly stirring to prevent lumping. Pass the mixture through a fine strainer to sift out lumpy materials. Ensure intimate mixing, stirring as often as possible to avoid settling. Keep mixture proportion constant for a uniform texture. Mix only enough material to prevent waste. Workability of Plexibond mixture is 30 minutes, while the potlife is 2 hours."},{"title":"APPLICATION SCHEDULE","variant":"0","subtitle":"","body":"For vertical surfaces such as firewalls, apply one coat of Plexibond mixture using a textured roller (for orange peel texture finish) or two coats by brush (for plain finish) while maintaining coverage rate at 5-6 square meters. Recoating interval is 1-2 hours.\nFor filling large cracks, add 3 parts by volume of fine, uniform-sized sand to 1-part cement and mix with Plexibond to a trowellable consistency.\nSuggested topcoats are <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Permacoat&trade; Latex, <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Acrytex&trade;, <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Acqua Epoxy&trade;, or <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Epoxy Enamel. Allow Plexibond to dry for at least one day before paint application.\nFor horizontal surfaces such as roof decks, parapets, canopies, and ledges, slowly mix 6.5 kg cement to 4-Liters Plexibond and apply 3-5 coats by brush or 2-3 coats by textured roller.\nReinforce joints, corners and active cracks susceptible to cracking or movement with a strip of fiberglass matting. Put on the matting immediately after the second coat while the mixture is still wet. The matting should adhere to the mixture. Make sure the Plexibond coating and the matting are completely dry before applying succeeding coats. The matting should be completely covered by the mixture. Let dry for one day, and then apply a bond coat by brushing <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Plexibond&trade; straight from the can prior to laying out mortar topping."}]}