{"id":"75","name":"Konstrukt&trade; Permaplast&trade;","subtitle":"K-202 High-Performance Acrylic Render","image":"data\/1075.jpg","url":"konstrukt-permaplast-k-202-high-performance-acrylic-render","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/web\/full\/1075.jpg","canimageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/can\/75\/d3cdadb1-4f11-4e7d-9f58-d06098901212\/konstrukt permaplast k-202 high performance acrylic render.png","rgbhexcolor":"","imagelogourl":"","imageweburl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/page\/full\/1075.jpg","imagewebmobileurl":"","bannerurl":"","colors":"0","techdata":"8","linkdata":[{"title":"Download Brochure","url":"https:\/\/files.boysencdn.com\/boysen\/brochures\/Konstrukt Construction Chemicals eBrochure.pdf"}],"info":[{"title":"DESCRIPTION","subtitle":"","body":"Konstrukt&trade; Permaplast&trade; K-202 High-Performance Acrylic Render is a specially formulated bonding paste that is mixed with cement and applied on interior and exterior concrete to level uneven surfaces. It cures to a fine sand finish and repairs bubbles, honeycomb, and concrete defects such as waviness and plumbness along with large holes and cracks from 3mm to 5mm."},{"title":"PRINCIPAL USES","variant":"1","subtitle":"","body":"It is ideal for interior and exterior concrete surfaces."},{"title":"FEATURES","variant":"1","subtitle":"","body":"Fixes wall imperfections 3mm to 5mm\nMinimizes cracking and improves water resistance"},{"title":"SURFACE PREPARATION","variant":"1","subtitle":"","body":"Surface should be clean and dry, free from oil, grease, dirt, contaminants, and all loose grit and mortar. Always dampen the concrete before application. Plastered walls should already be cured for at least 14-28 days prior to the application of the render."},{"title":"MATERIAL PREPARATION","variant":"1","subtitle":"","body":"Thoroughly mix K-202 High Performance Acrylic Render in its container. Afterwards, transfer the product to a suitable container and mix it with sifted cement at a 1:1 ratio by weight until a lump-free, homogenous paste is achieved. Do not add water. Use Portland cement (for ordinary cement color) or white cement (to produce a white finish)."},{"title":"APPLICATION SCHEDULE","variant":"1","subtitle":"","body":"Using a steel trowel, apply a thin layer of mixture on the surface by firmly pressing the edge of the trowel on the concrete until all areas are covered. Let it dry for at least 1 hour before applying the second coat. If trowel marks are visible, let surface dry for at least another hour before sanding to further smoothen surfaces. Allow at least 7 days to cure before painting. No need to neutralize."}]}