{"id":"81","name":"Konstrukt&trade; K-630 Join \"N\" Seal Hybrid Polyurethane Sealant","subtitle":"","image":"data\/1081.jpg","url":"konstrukt-k-630-join-n-seal-hybrid-polyurethane-sealant","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/full\/1081.jpg","bannerurl":"","colors":1,"techdata":"12","info":[{"title":"DESCRIPTION","subtitle":"","body":"Konstrukt&trade; Join \"N\" Seal Hybrid Polyurethane Sealant is a high quality, professional and universal low modulus sealant based on hybrid technology that cures under the influence of humidity to form a durable elastic rubber.\nIt is specially developed for the sealing of construction and expansion joints and joints in pedestrian walkways on most common building materials such as concrete, brick, painted wood, metal, and a variety of plastics.\nOnce properly cured, the product can be painted over using suitable water-based elastomeric paint."},{"title":"FEATURES","variant":"0","subtitle":"","body":"For interior and exterior use\nFree of isocyanates, solvents, and silicones\nAdheres to the substrate well without the use of primer on most surfaces\nLow modulus\nCures neutrally\nLow in odor\nDoes not shrink over time and is bubble free\nGood UV, weather, and water resistance\nDurable, permanent, and elastic\nHigh mechanical resistance strength"},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"The key to long-term sealant and adhesive performance is proper substrate preparation. The substrate must be clean, dry, and free of any oils, greases, incompatible sealers, paints or coatings that may interfere with adhesion and good joint performance. Porous surfaces should be cleaned of dust and debris from fabrication or job site dirt before cleaning using a stiff brush or using oil and moisture free compressed air. Mechanical methods, such as wire brushes or grinders, may be required to remove surface contamination, debris, and failed sealants such as in re-caulking applications."},{"title":"JOINT DESIGN","variant":"0","subtitle":"","body":"A well-designed joint should have a sufficient width so it would be able to take and process the movement of the adjacent building elements. A general rule is the ratio of joint depth to joint width (with a maximum size of 10mm) should be 1:1, with a minimum of 5mm in width and depth. For joints wider than 10mm, the ratio is 1:2 with a minimum depth of at least 10mm and a maximum of 15mm."},{"title":"APPLICATION AND CURING","variant":"0","subtitle":"","body":"Apply Konstrukt&trade; Join \"N\" Seal Hybrid Polyurethane Sealant using a professional caulking gun."},{"title":"CLEANING","variant":"0","subtitle":"","body":"Excess sealants should be cleaned off the substrate while it is still uncured using commercial cleaners."}]}