{"id":"71","name":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade;","subtitle":"","image":"data\/1071.jpg","colors":5,"techdata":"10","info":[{"title":"DESCRIPTION","subtitle":"","body":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade;  is a solvent-based, deep penetrating type of stain that combines decorative, water repellent, and wood preserving properties in one. It dries to a silk matte finish and emphasizes the grain, bringing out the natural beauty in any kind of wood."},{"title":"PRINCIPAL USES","variant":"0","subtitle":"","body":"It is ideal for interior and exterior wooden surfaces."},{"title":"FEATURES","variant":"0","subtitle":"","body":"It is the best way to protect wood due to its excellent sealing properties. It also prevents the growth of mold and fungi."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"Surface to be painted should be clean and dry, free from dust, dirt, and other foreign matter. Hammer all nails deep enough to apply putty. Sand rough wood until smooth and then dust off before painting.\nIf repainting, scrape off all loose, scaling, flaking, and peeling paint manually or by using <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Paint and Varnish Remover B&#8209;141, as necessary. Wash surfaces clean and completely remove chemical residue. Let it dry."},{"title":"PAINTING SCHEDULE","variant":"0","subtitle":"","body":"Apply <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade; to bare wood without primers or undercoats either by brush, spray or by dipping in an open trough or tank to achieve total covering rate. Shake and stir Xyladecor often during use.\nBy Brush: Lightly brush or wipe over once along the grain to remove excess material and to smooth out any runs. Leave each coat for about 4-8 hours or until totally dry. Recoat for a darker shade.\nBy Spray: Use a nozzle (about 1.5 mm) giving a stream of material. Working pressure should be approximately 40 psi. \nBy Dipping: Dip the timber in <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade; for 2 minutes, varying the time required according to the absorbency of the wood. Stand the timber on end and allow to drain. If necessary, lightly brush the surface once in the direction of the grain before it dries.\nNote: If a very even colored finish is desired on the wooden substrate with varying degrees of absorbency, apply <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade; Colorless first before applying the colored varieties of Xyladecor. <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Xyladecor&trade; Colorless is not recommended for exterior use on its own."}]}