{"id":"68","name":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Skimkote","subtitle":"","image":"data\/1.jpg","url":"boysen-skimkote","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/brand\/web\/full\/1.jpg","imageweburl":"","imagewebmobileurl":"","bannerurl":"","colors":0,"techdata":"11","info":[{"title":"DESCRIPTION","subtitle":"","body":"<span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Skimkote  is a special bonding paste that is mixed with cement and applied on concrete to correct surface imperfections prior to painting. It repairs bubbles, honeycomb and concrete defects on waviness and plumbness 2-3 mm thick."},{"title":"PRINCIPAL USES","variant":"0","subtitle":"","body":"For both interior and exterior plastered concrete, concrete slabs, reinforced concrete walls, and pre-cast concrete surfaces in lieu of cement plaster to eliminate surface defects and make the surface smooth and ready for painting."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"Surface should be clean, free from oil, grease, dust, dirt, contaminants, and all loose grit and mortar. Defects on concrete that are more than 3 mm thick should be addressed by corrective civil works. Dampen the concrete before application."},{"title":"MATERIAL PREPARATION","variant":"0","subtitle":"","body":"Put <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Skimkote in a suitable container and mix it with sifted cement at a 1:1 ratio by weight until a lump-free, homogenous paste is achieved. Do not add water. Use Portland cement (for ordinary cement color) or white cement (to produce a white finish)."},{"title":"APPLICATION SCHEDULE","variant":"0","subtitle":"","body":"Using a steel trowel, apply a thin layer of mixture on the surface by firmly pressing the edge of the trowel on the concrete until all areas are covered. Let it dry for at least 30 minutes before applying the second coat (if necessary). If trowel marks are visible, let surface dry for at least 30 minutes before sanding to further smoothen surfaces. No need to neutralize the surface. Allow at least 7 days before painting."}]}