{"id":"113","name":"Konstrukt&trade; Trafficshield&trade;","subtitle":"K-421 Floor Putty","image":"data\/1113.jpg","url":"konstrukt-trafficshield-k-421-floor-putty","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/web\/full\/1113.jpg","canimageurl":"","rgbhexcolor":"","imagelogourl":"","imageweburl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/page\/full\/1113.jpg","imagewebmobileurl":"","bannerurl":"","colors":"0","techdata":"5","linkdata":[{"title":"Download Brochure","url":"https:\/\/files.boysencdn.com\/boysen\/brochures\/Konstrukt Construction Chemicals eBrochure.pdf"}],"info":[{"title":"DESCRIPTION","subtitle":"","body":"Konstrukt&trade; Trafficshield&trade; K-421 Floor Putty is a water-based cementitious epoxy compound designed to cover minor floor surface imperfections from 0.5mm to 2mm."},{"title":"MATERIAL PREPARATION","variant":"0","subtitle":"","body":"1. Mix K-421 Floor Putty Part B with K-421 Floor Putty Part A until homogenous.\n2. Add K-421 Floor Putty Part C into the mixture and stir until homogenous.\n3. Mixture can only be used within a 30-minute working time.\n4. When intended to fill in cracks, use mixture immediately after mixing.\n5. Allow 10-minute induction time when used as a putty.\n6. Avoid the addition of water to mixture that has been to set."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"","body":"Surface should be clean and dry, free from oil, grease, dirt, contaminants, and all loose grit and mortar. Thickness requirement for application is 0.5mm to 2mm only."},{"title":"APPLICATION SCHEDULE","variant":"0","subtitle":"","body":"1. Apply the mixture onto the substrate by using a putty knife.\n2. Avoid the addition of water into the mixture that has begun to set. It will weaken the properties of the product.\n3. Allow product to cure for 1 day prior to the application of the desired system.\n4. Product should be cured for at least 3 days prior to light traffic, 7 days prior for normal traffic.\n5. When intended to fill cracks, use immediately after mixing.\n6. Allow 10 minutes induction time when used as a putty."}]}