{"id":"90","name":"Virtuoso&trade; Silk Touch&trade;","subtitle":"Easy Clean Paint","image":"data\/1090.jpg","url":"virtuoso-silk-touch-easy-clean-paint","imageurl":"https:\/\/files.boysencdn.com\/boysen\/uploads\/product\/full\/1090.jpg","bannerurl":"","colors":33,"techdata":"11","info":[{"title":"DESCRIPTION","subtitle":"","body":"Virtuoso&trade; Silk Touch&trade; is a breakthrough product that incorporates an easy clean surface protector technology to create a paint formula that uniquely combines the visual elegance of matte paints with the easy clean capabilities of gloss paints."},{"title":"PRINCIPAL USES","variant":"0","subtitle":"","body":"It is best for areas in need of stain resistant walls. It is intended for interior surfaces such as concrete and drywall substrates"},{"title":"FEATURES","variant":"0","subtitle":"","body":"Virtuoso&trade; Silk Touch&trade; is a 100% acrylic water-based paint that is low-odor, low-VOC, lead-free, and has outstanding color retention. Also formulated to be antibacterial, it protects your walls from potentially harmful bacteria such as E. coli and Salmonella. It dries to a luxurious silk finish that imparts a sense of warmth and depth to your living space and provides a surface that is distinctively smooth to the touch. With its easy clean capabilities, oil and dirt cannot easily stick the walls, making it easy to wipe off common everyday stains."},{"title":"SERVICE CONDITIONS","variant":"0","subtitle":"","body":"Allow to dry for at least 7 days after application to reach full stain resistance. Wipe stains off with moderate pressure using a soft cloth and household cleaner. Do not use abrasive cleaners as these may damage the paint film."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"New Concrete","body":"Allow new concrete to dry for 14-28 days under normal weather conditions before painting. Surface to be painted should be clean and dry, free from oil, grease, dust, dirt, contaminants, and all loose grit and mortar. If neutralizing, treat surface with a solution of 1 part <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Masonry Neutralizer B&#8209;44 diluted in 16 parts water, applying liberally by brush or roller. Let dry overnight before rinsing with water to remove white crystals that form on the surface. Let dry before painting. However, if the concrete has been cured for more than 28 days, there is no need for neutralizer."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"Drywall Substrates","body":"Install and secure joints as per manufacturer's recommendations."},{"title":"SURFACE PREPARATION","variant":"0","subtitle":"Repainting","body":"Scrape off all loose, scaling, flaking, and peeling paint manually or by using <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Paint and Varnish Remover B&#8209;141, as necessary. Wash surfaces clean and completely remove chemical residue. Let it dry. \nFor repainting concrete with chalky old paint, use <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Chalk Blocker&trade; B&#8209;7304 as surface conditioner. In case of mildew infestation, treat with a bleach solution (1:3, laundry bleach to water, respectively) by swabbing or brushing. To ensure proper treatment, let stand for 24 hours before cleaning off residue. Let dry."},{"title":"PAINTING SCHEDULE","variant":"0","subtitle":"For Concrete and Drywall Surfaces","body":"Primer: <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Permacoat&trade; Flat Latex B&#8209;701\nPutty: <span class='boysen-name'>BOYSEN<span class='boysen-reg'>&reg;</span><span class='boysen-reg-holder'>&reg;</span></span> Masonry Putty B&#8209;7311 \n2nd & 3rd coat: Virtuoso&trade; Silk Touch&trade;"}]}